Repository: microsoft/WSL
Catalog: localization/strings/*/Resources.resw
Source language: en_us
Languages: cs_cz, da_dk, de_de, el_gr, es_es, fi_fi, fr_fr, hu_hu, it_it, ja_jp, ko_kr, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ru_ru, sv_se, tr_tr, zh_cn, zh_tw

# Settings_AutoMemoryReclaimComboBox.AutomationProperties.HelpText
source: Automatically releases cached memory after detecting idle CPU usage. Set to gradual for slow release, and dropcache for instant release of cached memory.
cs_cz: Automaticky uvolní paměť uloženou v mezipaměti po zjištění nečinné spotřeby procesoru. Nastavte na postupné pomalé uvolňování a dropcache pro okamžité uvolnění paměti uložené v mezipaměti.
da_dk: Frigiver automatisk cachelagret hukommelse efter registrering af inaktiv CPU-brug. Indstillet til gradvis for langsom udgivelse og dropcache for øjeblikkelig frigivelse af cachelagret hukommelse.
de_de: Gibt automatisch zwischengespeicherten Arbeitsspeicher frei, nachdem die Leerlauf-CPU-Auslastung erkannt wurde. Legen Sie diese Option auf „Schrittweise“ für die langsame Freigabe und auf „Dropcache“ fest, um den zwischengespeicherten Speicher sofort freizugeben.
el_gr: Απελευθερώνει αυτόματα τη μνήμη cache μετά τον εντοπισμό αδρανούς χρήσης της CPU. Ορίστε το σε gradual για αργή απελευθέρωση και dropcache για άμεση απελευθέρωση της μνήμης cache.
es_es: Libera automáticamente la memoria en caché después de detectar el uso de CPU inactivo. Establézcalo en gradual para liberación lenta y dropcache para liberación instantánea de la memoria almacenada en caché.
fi_fi: Vapauttaa välimuistiin tallennetun muistin automaattisesti käyttämättömän suoritinkäytön havaitsemisen jälkeen. Aseta gradual, jos haluat hidasta vapautusta, ja dropcache, jos haluat välitöntä vapautusta välimuistista.
fr_fr: Libère automatiquement la mémoire mise en cache après avoir détecté l’utilisation de l’UC inactive. La valeur graduelle est utilisée pour une libération lente, et la valeur drop cache pour une libération instantanée de la mémoire en cache.
hu_hu: Automatikusan felszabadítja a gyorsítótárazott memóriát az üresjárati CPU-használat észlelése után. Lassú felszabadítás esetén gradual, a gyorsítótárazott memória azonnali felszabadításához pedig dropcache értékre állítsa.
it_it: Rilascia automaticamente la memoria memorizzata nella cache dopo il rilevamento dell'utilizzo della CPU inattiva. Impostare su graduale per il rilascio lento e su DropCache per il rilascio istantaneo della memoria memorizzata nella cache.
ja_jp: アイドル状態の CPU 使用率を検出した後、キャッシュされたメモリを自動的に解放します。低速リリースの場合は gradual に設定し、キャッシュされたメモリの即時解放では dropcache に設定します。
ko_kr: 유휴 CPU 사용량을 감지한 후 캐시된 메모리를 자동으로 해제합니다. 캐시된 메모리를 느리게 해제하려면 gradual로 설정하고 즉시 해제하려면 dropcache로 설정합니다.
nb_no: Frigir automatisk hurtigbufret minne etter å ha oppdaget inaktiv CPU-bruk. Angi gradvis for langsom frigivelse, og dropcache for umiddelbar frigivelse av hurtigbufret minne.
nl_nl: Automatisch geheugen in cache vrijmaken na detectie van niet-actief CPU-gebruik. Ingesteld op geleidelijk voor langzame release en dropcache voor directe vrijgave van geheugen in cache.
pl_pl: Automatycznie zwalnia pamięć buforowaną po wykryciu bezczynnego użycia procesora. Ustaw od stopniowego do wolnego zwalniania i dropcache na potrzeby natychmiastowego zwolnienia pamięci podręcznej.
pt_br: Libera automaticamente a memória armazenada em cache depois de detectar o uso ocioso de CPU. Defina como gradual para liberação lenta e dropcache para liberação instantânea de memória armazenada em cache.
pt_pt: Liberta automaticamente memória em cache após detetar a utilização inativa da CPU. Defina como "gradual" para libertação lenta e "dropcache" para libertação instantânea de memória em cache.
ru_ru: Автоматически освобождает кэшированную память после обнаружения использования процессора в режиме ожидания. Задайте постепенный режим для медленного выпуска и отбрасывание кэша для мгновенного освобождения кэшированной памяти.
sv_se: Frigör automatiskt cachelagrat minne efter identifiering av inaktiv CPU-användning. Ställ in på gradvis för långsam frisläppning och dropcache för omedelbar frisläppning av cachelagrat minne.
tr_tr: Boşta CPU kullanımı algılandıktan sonra önbelleğe alınan belleği otomatik olarak serbest bırakır. Yavaş serbest bırakma için kademeli olarak ve önbelleğe alınan belleğin anında serbest bırakılması için dropcache olarak ayarlayın.
zh_cn: 检测到空闲 CPU 使用情况后自动释放缓存内存。设为 gradual 缓慢释放；设为 dropcache 迅速释放。
zh_tw: 偵測到閑置 CPU 使用量後，自動釋放快取的記憶體。設定為緩時釋放的漸進式，以及快取記憶體的即時釋放投遞。

# Settings_AutoProxy.Header
source: Auto Proxy enabled
cs_cz: Automatický proxy server povolen
da_dk: Automatisk proxy er aktiveret
de_de: Automatischer Proxy aktiviert
el_gr: Ενεργοποιημένο Auto Proxy
es_es: Proxy automático habilitado
fi_fi: Automaattinen välityspalvelin käytössä
fr_fr: Proxy automatique activé
hu_hu: Automatikus proxy engedélyezve
it_it: Proxy automatico abilitato
ja_jp: オート プロキシが有効
ko_kr: 자동 프록시 사용
nb_no: Automatisk proxy aktivert
nl_nl: Automatische proxy ingeschakeld
pl_pl: Włączono automatyczny serwer proxy
pt_br: Proxy Automático habilitado
pt_pt: Proxy Automático ativado
ru_ru: Автоматический прокси включен
sv_se: Automatisk proxy har aktiverats
tr_tr: Otomatik Ara Sunucu etkin
zh_cn: 已启用自动代理
zh_tw: 已啟用自動 Proxy

# Settings_AutoProxy.Description
source: Enables WSL to use Windows' HTTP proxy information.
cs_cz: Povoluje WSL používat informace o proxy serveru HTTP systému Windows.
da_dk: Muliggør, at WSL kan bruge http-proxyoplysninger fra Windows.
de_de: Ermöglicht WSL die Verwendung der HTTP-Proxyinformationen von Windows.
el_gr: Επιτρέπει στο WSL να χρησιμοποιεί τις πληροφορίες του διακομιστή μεσολάβησης HTTP των Windows.
es_es: Habilita a WSL para que use la información de proxy HTTP de Windows.
fi_fi: Sallii WSL:n käyttää Windowsin HTTP-välityspalvelintietoja.
fr_fr: Permet à WSL d’utiliser les informations de proxy HTTP de Windows.
hu_hu: Lehetővé teszi a WSL-nek a Windows HTTP-proxyadatainak használatát.
it_it: Consente a WSL di utilizzare le informazioni sul proxy HTTP di Windows.
ja_jp: WSL で Windows の HTTP プロキシ情報を使用できるようにします。
ko_kr: WSL에서 Windows의 HTTP 프록시 정보를 사용할 수 있도록 합니다.
nb_no: Gjør det mulig for WSL å bruke HTTP-proxyinformasjon for Windows.
nl_nl: Hiermee kan WSL de HTTP-proxygegevens van Windows gebruiken.
pl_pl: Włącza WSL w celu korzystania z informacji serwera proxy HTTP systemu Windows.
pt_br: Permite que o WSL utilize as informações de proxy HTTP do Windows.
pt_pt: Permite que o WSL utilize as informações de proxy HTTP do Windows.
ru_ru: Позволяет WSL использовать сведения HTTP-прокси Windows.
sv_se: Gör att WSL kan använda Windows HTTP-proxyinformation.
tr_tr: WSL'nin Windows'un HTTP ara sunucusu bilgilerini kullanmasına olanak verir.
zh_cn: 允许 WSL 使用 Windows 的 HTTP 代理信息。
zh_tw: 讓 WSL 使用 Windows 的 HTTP Proxy 資訊。

# Settings_AutoProxyToggleSwitch.AutomationProperties.Name
source: Auto Proxy enabled.
cs_cz: Automatický proxy server povolen.
da_dk: Automatisk proxy er aktiveret.
de_de: Automatischer Proxy aktiviert.
el_gr: Ενεργοποιημένο Auto Proxy.
es_es: Proxy automático habilitado.
fi_fi: Automaattinen välityspalvelin käytössä.
fr_fr: Proxy automatique activé.
hu_hu: Automatikus proxy engedélyezve.
it_it: Proxy automatico abilitato.
ja_jp: オート プロキシが有効です。
ko_kr: 자동 프록시를 사용하도록 설정했습니다.
nb_no: Automatisk proxy aktivert.
nl_nl: Automatische proxy ingeschakeld.
pl_pl: Włączono automatyczny serwer proxy.
pt_br: Proxy Automático habilitado.
pt_pt: Proxy Automático ativado.
ru_ru: Автоматический прокси включен.
sv_se: Automatisk proxy har aktiverats.
tr_tr: Otomatik Ara Sunucu etkin.
zh_cn: 已启用自动代理。
zh_tw: 已啟用自動 Proxy。

# Settings_AutoProxyToggleSwitch.AutomationProperties.HelpText
source: Enables WSL to use Windows' HTTP proxy information.
cs_cz: Povoluje WSL používat informace o proxy serveru HTTP systému Windows.
da_dk: Muliggør, at WSL kan bruge http-proxyoplysninger fra Windows.
de_de: Ermöglicht WSL die Verwendung der HTTP-Proxyinformationen von Windows.
el_gr: Επιτρέπει στο WSL να χρησιμοποιεί τις πληροφορίες του διακομιστή μεσολάβησης HTTP των Windows.
es_es: Habilita a WSL para que use la información de proxy HTTP de Windows.
fi_fi: Sallii WSL:n käyttää Windowsin HTTP-välityspalvelintietoja.
fr_fr: Permet à WSL d’utiliser les informations de proxy HTTP de Windows.
hu_hu: Lehetővé teszi a WSL-nek a Windows HTTP-proxyadatainak használatát.
it_it: Consente a WSL di utilizzare le informazioni sul proxy HTTP di Windows.
ja_jp: WSL で Windows の HTTP プロキシ情報を使用できるようにします。
ko_kr: WSL에서 Windows의 HTTP 프록시 정보를 사용할 수 있도록 합니다.
nb_no: Gjør det mulig for WSL å bruke HTTP-proxyinformasjon for Windows.
nl_nl: Hiermee kan WSL de HTTP-proxygegevens van Windows gebruiken.
pl_pl: Włącza WSL w celu korzystania z informacji serwera proxy HTTP systemu Windows.
pt_br: Permite que o WSL utilize as informações de proxy HTTP do Windows.
pt_pt: Permite que o WSL utilize as informações de proxy HTTP do Windows.
ru_ru: Позволяет WSL использовать сведения HTTP-прокси Windows.
sv_se: Gör att WSL kan använda Windows HTTP-proxyinformation.
tr_tr: WSL'nin Windows'un HTTP ara sunucusu bilgilerini kullanmasına olanak verir.
zh_cn: 允许 WSL 使用 Windows 的 HTTP 代理信息。
zh_tw: 讓 WSL 使用 Windows 的 HTTP Proxy 資訊。

# Settings_BestEffortDNS.Header
source: Use best effort DNS parsing
cs_cz: Využití analýzy DNS s maximálním úsilím
da_dk: Brug DNS-parsing, der gør det bedst muligt
de_de: Bestmögliche DNS-Analyse verwenden
el_gr: Χρήση ανάλυσης DNS βέλτιστης προσπάθειας
es_es: Usar el mejor esfuerzo de análisis de DNS
fi_fi: Käytä parasta mahdollista DNS-jäsennystä
fr_fr: Utiliser l'analyse Domain Name Service (DNS) la plus efficace possible
hu_hu: A lehető legjobb DNS-elemzést használja
it_it: Usa l'analisi DNS più efficiente
ja_jp: ベスト エフォート DNS 解析を使用する
ko_kr: 최상의 DNS 구문 분석 사용
nb_no: Bruk beste forsøk på DNS-analyse
nl_nl: DNS-analyse met de beste poging gebruiken
pl_pl: Korzystanie z analizowania DNS w najlepszy sposób
pt_br: Usar a melhor análise de DNS de esforço
pt_pt: Utilizar análise de DNS de melhor esforço
ru_ru: Используйте лучший анализ DNS
sv_se: Använd bästa möjliga DNS-parsning
tr_tr: DNS ayrıştırma için en iyi çabayı kullan
zh_cn: 尽力进行 DNS 解析
zh_tw: 使用最佳作業效果的 DNS 剖析

# Settings_BestEffortDNS.Description
source: Only applicable when wsl2.dnsTunneling is set to true. When set to true, Windows will extract the question from the DNS request and attempt to resolve it, ignoring the unknown records.
cs_cz: Lze použít pouze v případě, že je vlastnost wsl2.dnsTunneling nastavena na hodnotu true. Pokud je tato hodnota nastavená na true, systém Windows extrahuje otázku z požadavku DNS a pokusí se ji vyřešit a ignoruje neznámé záznamy.
da_dk: Gælder kun, når wsl2.dnsTunneling er indstillet til sand. Når den er indstillet til sand, udtrækker Windows spørgsmålet fra DNS-anmodningen og forsøger at løse det og ignorerer de ukendte poster.
de_de: Gilt nur, wenn „wsl2.dnsTunneling“ auf „TRUE“ festgelegt ist. Wenn diese Option auf „TRUE“ festgelegt ist, extrahiert Windows die Frage aus der DNS-Anfrage und versucht, sie aufzulösen, wobei die unbekannten Einträge ignoriert werden.
el_gr: Ισχύει μόνο όταν το wsl2.dnsTunneling έχει οριστεί σε true. Όταν οριστεί σε true, τα Windows θα εξαγάγουν το ερώτημα από το αίτημα DNS και θα προσπαθήσουν να το επιλύσουν, αγνοώντας τις άγνωστες εγγραφές.
es_es: Solo es aplicable cuando wsl2.dnsTunneling se establece en true. Cuando se establece en true, Windows extraerá la pregunta de la solicitud DNS e intentará resolverla, omitiendo los registros desconocidos.
fi_fi: Käytettävissä vain, kun wsl2.dnsTunneling on true. Kun asetus on true, Windows poimii kysymyksen DNS-pyynnöstä ja yrittää ratkaista sen ohittaen tuntemattomat tietueet.
fr_fr: Applicable uniquement lorsque wsl2.dnsTunneling a la valeur true. Lorsque la valeur est true, Windows extrait la question de la requête Domain Name Service (DNS) et tente de la résoudre, en ignorant les enregistrements inconnus.
hu_hu: Csak akkor alkalmazható, ha a wsl2.dnsTunneling értéke true. Ha igaz értékre van állítva, a Windows kinyeri a kérdést a DNS-kérelemből, és megkísérli a megoldását, figyelmen kívül hagyva az ismeretlen rekordokat.
it_it: Applicabile solo quando wsl2.dnsTunneling è impostato su true. Se impostato su true, Windows estrarrà la domanda dalla richiesta DNS e tenterà di risolverla ignorando i record sconosciuti.
ja_jp: wsl2.dnsTunneling が true に設定されている場合にのみ適用されます。true に設定すると、Windows は DNS 要求から質問を抽出し、不明なレコードを無視して解決を試みます。
ko_kr: wsl2.dnsTunneling true로 설정된 경우에만 적용할 수 있습니다. true로 설정하면 Windows에서 DNS 요청에서 질문을 추출하고 resolve 시도합니다. 알 수 없는 레코드는 무시됩니다.
nb_no: Gjelder bare når wsl2.dnsTunneling er satt til sann. Når satt til sann, trekker Windows ut spørsmålet fra DNS-forespørselen og prøver å løse det, og de ukjente postene ignoreres.
nl_nl: Alleen van toepassing wanneer wsl2.dnsTunneling is ingesteld op true. Als deze optie is ingesteld op true, wordt de vraag geëxtraheerd uit de DNS-aanvraag en wordt geprobeerd deze op te lossen, waarbij de onbekende records worden genegeerd.
pl_pl: Ma zastosowanie tylko wtedy, gdy właściwość wsl2.dnsTunneling jest ustawiona na wartość true. Po ustawieniu wartości true system Windows wyodrębni pytanie z żądania DNS i podejmie próbę jego rozwiązania, ignorując nieznane rekordy.
pt_br: Aplicável somente quando wsl2.dnsTunneling é definido como verdadeiro. Quando definido como true, o Windows extrairá a pergunta da solicitação DNS e tentará resolve-la, ignorando os registros desconhecidos.
pt_pt: Apenas aplicável quando wsl2.dnsTunneling está definido como verdadeiro. Quando definido como verdadeiro, o Windows extrairá a pergunta do pedido DNS e tentará resolvê-la, ignorando os registos desconhecidos.
ru_ru: Применимо, тольк, если для параметра wsl2.dnsTunneling установлено значение ИСТИНА. Если установлено значение ИСТИНА, Windows извлечет вопрос из запроса DNS и попытается его решить, игнорируя неизвестные записи.
sv_se: Gäller endast när wsl2.dnsTunneling har angetts till true. När värdet är true extraherar Windows frågan från DNS-begäran och försöker lösa den och ignorerar de okända posterna.
tr_tr: Yalnızca wsl2.dnsTunneling true olarak ayarlandığında geçerlidir. True olarak ayarlandığında, Windows soruyu DNS isteğinden çıkarır ve bilinmeyen kayıtları yok sayarak çözmeye çalışır.
zh_cn: 仅当 wsl2.dnsTunneling 设置为 true 时适用。设置为 true 时，Windows 将从 DNS 请求中提取问题并尝试解决该问题，忽略未知记录。
zh_tw: 僅適用於 wsl2.dnsTunneling 設為 true 時。設定為 true 時，Windows 會從 DNS 要求擷取問題，並嘗試加以解決，並忽略未知的記錄。

# Settings_BestEffortDNSToggleSwitch.AutomationProperties.Name
source: Use best effort DNS parsing.
cs_cz: Využijte parsování DNS s maximálním úsilím.
da_dk: Brug DNS-parsing, der gør det bedst muligt.
de_de: Bestmögliche DNS-Analyse verwenden.
el_gr: Χρήση ανάλυσης DNS βέλτιστης προσπάθειας.
es_es: Usar el mejor esfuerzo de análisis de DNS.
fi_fi: Käytä parasta mahdollista DNS-jäsennystä.
fr_fr: Utilisez le meilleur effort d’analyse DNS.
hu_hu: A lehető legjobb DNS-elemzést használja.
it_it: Usa l'analisi DNS più efficiente.
ja_jp: ベスト エフォート DNS 解析を使用します。
ko_kr: 최상의 DNS 구문 분석을 사용합니다.
nb_no: Bruk DNS-analyse med beste innsats.
nl_nl: DNS-analyse met de beste poging gebruiken.
pl_pl: Korzystanie z analizowania DNS w najlepszy sposób.
pt_br: Usar a melhor análise de DNS de esforço.
pt_pt: Utilizar análise de DNS de melhor esforço.
ru_ru: Используйте лучший анализ DNS.
sv_se: Använd bästa möjliga DNS-parsning.
tr_tr: DNS ayrıştırma için en iyi girişimi kullanın.
zh_cn: 尽力进行 DNS 分析。
zh_tw: 使用最佳作用的 DNS 剖析。

# Settings_BestEffortDNSToggleSwitch.AutomationProperties.HelpText
source: Only applicable when wsl2.dnsTunneling is set to true. When set to true, Windows will extract the question from the DNS request and attempt to resolve it, ignoring the unknown records.
cs_cz: Lze použít pouze v případě, že je vlastnost wsl2.dnsTunneling nastavena na hodnotu true. Pokud je tato hodnota nastavená na true, systém Windows extrahuje otázku z požadavku DNS a pokusí se ji vyřešit a ignoruje neznámé záznamy.
da_dk: Gælder kun, når wsl2.dnsTunneling er angivet til true. Når den er indstillet til sand, udtrækker Windows spørgsmålet fra DNS-anmodningen og forsøger at løse det og ignorerer de ukendte poster.
de_de: Gilt nur, wenn „wsl2.dnsTunneling“ auf „TRUE“ festgelegt ist. Wenn diese Option auf „TRUE“ festgelegt ist, extrahiert Windows die Frage aus der DNS-Anfrage und versucht, sie aufzulösen, wobei die unbekannten Einträge ignoriert werden.
el_gr: Ισχύει μόνο όταν το wsl2.dnsTunneling έχει οριστεί σε true. Όταν οριστεί σε true, τα Windows θα εξαγάγουν το ερώτημα από το αίτημα DNS και θα προσπαθήσουν να το επιλύσουν, αγνοώντας τις άγνωστες εγγραφές.
es_es: Solo es aplicable cuando wsl2.dnsTunneling está establecido en true. Cuando se establece en true, Windows extraerá la pregunta de la solicitud DNS e intentará resolverla, omitiendo los registros desconocidos.
fi_fi: Käytettävissä vain, kun wsl2.dnsTunneling-asetus on true. Kun asetus on true, Windows poimii kysymyksen DNS-pyynnöstä ja yrittää ratkaista sen ohittaen tuntemattomat tietueet.
fr_fr: Applicable uniquement lorsque wsl2.dnsTunneling a la valeur true. Lorsque la valeur est true, Windows extrait la question de la requête Domain Name Service (DNS) et tente de la résoudre, en ignorant les enregistrements inconnus.
hu_hu: Csak akkor alkalmazható, ha a wsl2.dnsTunneling értéke true. Ha igaz értékre van állítva, a Windows kinyeri a kérdést a DNS-kérelemből, és megkísérli a megoldását, figyelmen kívül hagyva az ismeretlen rekordokat.
it_it: Applicabile solo quando wsl2.dnsTunneling è impostato su true. Se impostato su true, Windows estrarrà la domanda dalla richiesta DNS e tenterà di risolverla ignorando i record sconosciuti.
ja_jp: wsl2.dnsTunneling が true に設定されている場合にのみ適用されます。true に設定すると、Windows は DNS 要求から質問を抽出し、不明なレコードを無視して解決を試みます。
ko_kr: wsl2.dnsTunneling이 true로 설정된 경우에만 적용할 수 있습니다. true로 설정하면 Windows에서 DNS 요청에서 질문을 추출하고 resolve 시도합니다. 알 수 없는 레코드는 무시됩니다.
nb_no: Gjelder bare når wsl2.dnsTunneling er satt til sann. Når satt til sann, trekker Windows ut spørsmålet fra DNS-forespørselen og prøver å løse det, og de ukjente postene ignoreres.
nl_nl: Alleen van toepassing wanneer wsl2.dnsTunneling is ingesteld op true. Als deze optie is ingesteld op true, wordt de vraag geëxtraheerd uit de DNS-aanvraag en wordt geprobeerd deze op te lossen, waarbij de onbekende records worden genegeerd.
pl_pl: Ma zastosowanie tylko wtedy, gdy właściwość wsl2.dnsTunneling jest ustawiona na wartość true. Po ustawieniu wartości true system Windows wyodrębni pytanie z żądania DNS i podejmie próbę jego rozwiązania, ignorując nieznane rekordy.
pt_br: Apenas aplicável quando wsl2.dnsTunneling está definido como verdadeiro. Quando definido como verdadeiro, o Windows extrairá a pergunta do pedido DNS e tentará resolve-la, ignorando os registos desconhecidos.
pt_pt: Apenas aplicável quando wsl2.dnsTunneling está definido como verdadeiro. Quando definido como verdadeiro, o Windows extrairá a pergunta do pedido DNS e tentará resolvê-la, ignorando os registos desconhecidos.
ru_ru: Применимо, тольк, если для параметра wsl2.dnsTunneling установлено значение ИСТИНА. Если установлено значение ИСТИНА, Windows извлечет вопрос из запроса DNS и попытается его решить, игнорируя неизвестные записи.
sv_se: Gäller endast när wsl2.dnsTunneling har angetts till true. När värdet är true extraherar Windows frågan från DNS-begäran och försöker lösa den och ignorerar de okända posterna.
tr_tr: Yalnızca wsl2.dnsTunneling true olarak ayarlandığında geçerlidir. True olarak ayarlandığında, Windows soruyu DNS isteğinden çıkarır ve bilinmeyen kayıtları yok sayarak çözmeye çalışır.
zh_cn: 仅当 wsl2.dnsTunneling 设置为 true 时适用。设置为 true 时，Windows 将从 DNS 请求中提取问题并尝试解决该问题，忽略未知记录。
zh_tw: 僅適用於 wsl2.dnsTunneling 設為 true 時。設定為 true 時，Windows 會從 DNS 要求擷取問題，並嘗試加以解決，並忽略未知的記錄。

# Settings_CustomKernelPath.Header
source: Custom kernel
cs_cz: Vlastní jádro
da_dk: Brugerdefineret kerne
de_de: Benutzerdefinierter Kernel
el_gr: Προσαρμοσμένος πυρήνας
es_es: Kernel personalizado
fi_fi: Mukautettu ydin
fr_fr: Noyau personnalisé
hu_hu: Egyéni kernel
it_it: Kernel personalizzato
ja_jp: カスタム カーネル
ko_kr: 사용자 지정 커널
nb_no: Egendefinert kjerne
nl_nl: Aangepaste kernel
pl_pl: Niestandardowe jądro
pt_br: Kernel personalizado
pt_pt: Kernel personalizado
ru_ru: Настраиваемое ядро
sv_se: Anpassad kernel
tr_tr: Özel çekirdek
zh_cn: 自定义内核
zh_tw: 自訂核心

# Settings_CustomKernelPath.Description
source: An absolute Windows path to a custom Linux kernel.
cs_cz: Absolutní cesta Windows k vlastnímu jádru Linuxu.
da_dk: En absolut Windows-sti til en brugerdefineret Linux-kerne.
de_de: Ein absoluter Windows-Pfad zu einem benutzerdefinierten Linux-Kernel.
el_gr: Μια απόλυτη διαδρομή Windows προς έναν προσαρμοσμένο πυρήνα Linux.
es_es: Ruta de acceso absoluta de Windows a un kernel de Linux personalizado.
fi_fi: Absoluuttinen Windows-polku mukautettuun Linux-ytimeen.
fr_fr: Chemin d’accès Windows absolu à un noyau Linux personnalisé.
hu_hu: Egy egyéni Linux-kernel abszolút Windows-elérési útja.
it_it: Percorso assoluto di Windows per un kernel Linux personalizzato.
ja_jp: カスタム Linux カーネルへの Windows の絶対パス。
ko_kr: 사용자 지정 Linux 커널의 절대 Windows 경로입니다.
nb_no: En absolutt Windows-bane til en egendefinert Linux-kjerne.
nl_nl: Een absoluut Windows-pad naar een aangepaste Linux-kernel.
pl_pl: Bezwzględna ścieżka systemu Windows do niestandardowego jądra systemu Linux.
pt_br: Um caminho absoluto do Windows para um kernel do Linux personalizado.
pt_pt: Um caminho absoluto do Windows para um kernel Linux personalizado.
ru_ru: Абсолютный путь Windows к собственному ядру Linux.
sv_se: En absolut Windows-sökväg till en anpassad Linux-kernel.
tr_tr: Özel bir Linux çekirdeğinin mutlak Windows yolu.
zh_cn: 自定义 Linux 内核的绝对 Windows 路径。
zh_tw: 自訂Linux核心的絕對 Windows 路徑。

# Settings_CustomKernelPathBrowseButton.Content
source: Browse kernels
cs_cz: Procházet jádra
da_dk: Gennemse kerner
de_de: Kernels durchsuchen
el_gr: Αναζήτηση πυρήνων
es_es: Examinar kernels
fi_fi: Selaa ytimiä
fr_fr: Parcourir les noyaux
hu_hu: Kernelek tallózása
it_it: Esplora kernel
ja_jp: カーネルの参照
ko_kr: 커널 찾아보기
nb_no: Bla gjennom kjerner
nl_nl: Door kernels bladeren
pl_pl: Przeglądaj jądra
pt_br: Procurar kernels
pt_pt: Procurar kernels
ru_ru: Обзор ядер
sv_se: Bläddra bland kärnor
tr_tr: Çekirdeklere gözat
zh_cn: 浏览内核
zh_tw: 瀏覽核心

# Settings_CustomKernelPathTextBox.AutomationProperties.Name
source: Custom kernel
cs_cz: Vlastní jádro
da_dk: Brugerdefineret kerne
de_de: Benutzerdefinierter Kernel
el_gr: Προσαρμοσμένος πυρήνας
es_es: Kernel personalizado
fi_fi: Mukautettu ydin
fr_fr: Noyau personnalisé
hu_hu: Egyéni kernel
it_it: Kernel personalizzato
ja_jp: カスタム カーネル
ko_kr: 사용자 지정 커널
nb_no: Egendefinert kjerne
nl_nl: Aangepaste kernel
pl_pl: Niestandardowe jądro
pt_br: Kernel personalizado
pt_pt: Kernel personalizado
ru_ru: Настраиваемое ядро
sv_se: Anpassad kernel
tr_tr: Özel çekirdek
zh_cn: 自定义内核
zh_tw: 自訂核心
